"""
Домашнее задание:
1. Прочитать данные из текстового файла
2. Проанализировать данные. Подсчитать сколько слов в тексте, сколько раз встречается каждое слово
3. Сформировать словарь с результатом анализа вида
{"word": times[int]}
4. Сериализовать словать в json формат
5. Записать результат в json файл
6. Создать минимум 1 тест на написанный код


В начале пиши просто работающий код и не забывай делать коммиты на каждую логическую область
Затем почисти свой код, подумай над функциями, помни про DRY (коммиты!)
Дополни код комментарийми (коммиты!)

После выполнения тебе необходимо на гите создать pull request и дать мне ссылку
"""
